#+TITLE: Math Homework
#+AUTHOR: 2024110144
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{amsmath}
#+OPTIONS: \n:t

# 2.24 Thomas 12.1 1-66 mod 6 = 0
# 2.26 Thomas 12.2 1-56 mod 6 = 0
#             12.3 1-30 mod 6 = 0
# 2.28 Thomas 12.3 31-50 mod 6 = 0
#             12.4 1-34 mod 6 = 0

*** 6
- component form
  $(-16,29)$.
- magnitude length
  #+begin_src scheme :exports both
    (define (square x)
      (* x x))

    (define (magnitude-length . nums)
      (sqrt (apply + (map square nums))))

    (magnitude-length -16 29)
  #+end_src

  #+RESULTS:
  : 33.12099032335839

  Thus the length is about 33.
  
*** 36
$\vec{P_1 P_2} = (3,-6,2)$.
- a
  the direction of $\vec{P_1 P_2}$,
  #+begin_src scheme :exports both
    (let* ((vector-len (magnitude-length 3 -6 2))
	   (direction (map-in-order (lambda (num)
				      (/ num vector-len))
				    '(3 -6 2))))
      direction)
  #+end_src

  #+RESULTS:
  | 3/7 | -6/7 | 2/7 |

  Thus the direction is $(\frac{3}{7},-\frac{6}{7},\frac{2}{7})$.

- b
  the midpoint of line segment,
  The answer is $(2.5,1,6)$.

*** 12
\begin{align}
\vec{u} &= \vec{i} + \sqrt{2} \vec{j} - \sqrt{2} \vec{k}\\
\vec{v| &= -\vec{i} + \vec{j} + \vec{k}\\
\vec{u}\cdot\vec{v} &= -1\\
\left | \vec{u} \right | &= \sqrt{5}\\
\left | \vec{v} \right | &= \sqrt{3}\\
\left | \vec{u} \right | \cdot \left | \vec{v} \right | &= \sqrt{15}\\
\cos \theta &= \frac{\vec{u}\cdot\vec{v}}{\left | \vec{u} \right | \cdot \left | \vec{v} \right |}\\
&= -\frac{\sqrt{15}}{15}
\end{align}
#+begin_src scheme :exports both
  ;; calculate theta to the nearest hundreds of a radian
  (define cos-theta (- (/ 1 (sqrt 15))))
  (acos cos-theta) 
#+end_src

#+RESULTS:
: 1.831953737697921

Thus, the angle is about $1.83$.

*** 24
suppose $2.5 lb$ is about $1.13 kg$,
and is about $11.3 N$ in weight.
#+begin_src scheme :exports both
  (define pi 3.1415926)
  (define (d->r num)
    (* (/ num 180) pi))

  (define f1 (* 11.3 (sin (d->r 15))))
  (define w-f1-angle (- 33 15))

  (/ f1 (cos (d->r w-f1-angle)))
#+end_src

#+RESULTS:
: 3.075164415270255

Thus the force is about $3.075 N$.

*** 42
#+begin_src scheme :exports both
  (* 602148 (* 605 1000))
#+end_src

#+RESULTS:
: 364299540000

so it is about $364299540000 J$.

